#add this code to your .bashrc file 
echo -e "\e[36m"
cat << 'EOF'                          
               _                           
              | |                          
 __      _____| | ___ ___  _ __ ___   ___  
 \ \ /\ / / _ \ |/ __/ _ \| '_ ` _ \ / _ \ 
  \ V  V /  __/ | (_| (_) | | | | | |  __/ 
   \_/\_/ \___|_|\___\___/|_| |_| |_|\___| 
      | |             (_)                  
      | | ___  ___ ___ _  ___ __ _         
  _   | |/ _ \/ __/ __| |/ __/ _` |        
 | |__| |  __/\__ \__ \ | (_| (_| |        
  \____/ \___||___/___/_|\___\__,_|

 ∧,,,∧
( ̳• · •)
/    づ♡
EOF
echo -e "\e[0m"


while true; do  

	echo -e "\e[33m What would you like to do?\e[0m"
	echo -e " J: journal"
	echo -e " R: read past entries"
	echo -e " E: Exit"
	read action

	action="${action^^}"
	if [ $action = "J" ]; then 
		echo -e "\e[31m Sending you to journal...\e[0m"
		bash ~/journal.sh
	elif [ $action = "R" ]; then
		echo -e  "\e[31m Sending you to entry reader...\e[0m"
		 bash ~/readEntries.sh
	elif [ $action = "E" ]; then
		echo -e "\e[33m 
		░█████╗░██╗░█████╗░░█████╗░
		██╔══██╗██║██╔══██╗██╔══██╗
		██║░░╚═╝██║███████║██║░░██║
		██║░░██╗██║██╔══██║██║░░██║
		╚█████╔╝██║██║░░██║╚█████╔╝
		░╚════╝░╚═╝╚═╝░░╚═╝░╚════╝░
		\e[0m"
		break
	fi
	
done


